WELCOME = """
Здравствуйте! Этот чат создан для коммуникации по вашей заявке на получение лицензии.
С вами работают два менеджера - Валерия и Луиза. Мы будем сопровождать процесс оформления и предоставлять всю необходимую поддержку. В случае вопросов или необходимости уточнений вы всегда можете обратиться к нам.
"""

PAYMENT = """
Отправляю вам данные для оплаты по Zelle.

Оплата первого платежа {amount}$

Вместо номера телефона вводите yulia87andreeva@gmail.com

Бизнес название Andreev life LLC
После оплаты пришлите скриншот
"""

FORMS = {

    "CA": """
Уважаемый клиент,
Пожалуйста, внимательно заполните форму по ссылке ниже и убедитесь, что все данные указаны корректно. Эта информация необходима для правильного оформления документов:

https://docs.google.com/forms/d/e/1FAIpQLSe2CH2nAlzE0Am3zu-XKtGeRsgqlZIvMD5LiSI_aO2uSJA7eA/viewform?usp=embed_facebook

Если у вас возникнут вопросы при заполнении, пожалуйста, свяжитесь с нами - мы с радостью поможем.

Также просим отправить в этот чат:
— фото сертификатов/дипломов
— фото водительского удостоверения (Driver License)
(если у вас нет Driver License, вы можете предоставить любое другое удостоверение личности с фотографией)
""",

    "FL": """
Уважаемый клиент,

Пожалуйста, внимательно заполните форму по ссылке ниже и убедитесь, что все данные указаны корректно — эта информация необходима для правильного оформления документов:
https://docs.google.com/forms/d/e/1FAIpQLSe2CH2nAlzE0Am3zu-XKtGeRsgqlZIvMD5LiSI_aO2uSJA7eA/viewform?usp=embed_facebook

Если у вас возникнут вопросы при заполнении, пожалуйста, свяжитесь с нами — мы с радостью поможем.

Также просим отправить в этот чат:
— фото сертификатов/дипломов
— фото водительского удостоверения (Driver License)
(если у вас нет Driver License, вы можете предоставить любое другое удостоверение личности с фотографией)

Дополнительно вам необходимо пройти одобренный штатом 4-часовой курс по профилактике ВИЧ/СПИДа. Вы можете выбрать любой удобный вариант и пройти тест:

1. 4-часовой курс по ВИЧ/СПИДу Совета по косметологии Флориды
https://www.moniquecosmetique.com/courses/florida-board-of-cosmetology-4-hour-hiv-aids-course

2. Косметология 4 часа ВИЧ/СПИД:
https://edu.academixpartners.com/course/hiv?previouspage=home&isenrolled=no#/home

После прохождения, пожалуйста, отправьте сертификат в этот чат.
""",

    "PA": """
Уважаемый клиент,

Чтобы получить справку о несудимости в Пенсильвании, пожалуйста, перейдите по ссылке:
https://epatch.pa.gov
Обратите внимание: справка о несудимости, полученная для волонтёрских целей, не принимается.

Также просим вас внимательно заполнить форму по ссылке ниже и убедиться, что все данные указаны корректно — эта информация необходима для правильного оформления документов:
https://docs.google.com/forms/d/e/1FAIpQLSe2CH2nAlzE0Am3zu-XKtGeRsgqlZIvMD5LiSI_aO2uSJA7eA/viewform?usp=embed_facebook

Если у вас возникнут вопросы при заполнении, пожалуйста, свяжитесь с нами — мы с радостью поможем.

Дополнительно отправьте, пожалуйста, в этот чат:
— фото сертификатов/дипломов
— фото водительского удостоверения (Driver License)
(если у вас нет Driver License, вы можете предоставить любое другое удостоверение личности с фотографией)
"""
}

DOCUMENTS_READY = {
    "CA": """
Добрый день! Ваши документы подготовлены, переведены и отправлены в борд. Ожидаем одобрение в течении 2-14 раб. дней. Первая пошлина оплачена в размере $40 нашей картой. Ниже прикрепляю подтверждение оплаты.
Отправляю вам данные для оплаты по Zelle.

Оплата гос. пошлины 40$
Вместо номера телефона вводите yulia87andreeva@gmail.com
Бизнес название Andreev life LLC

После оплаты пришлите скрин
""",

    "PA": """
Ваша заявка на получение лицензии в штате Пенсильвания подана. Государственная пошлина в размере  долларов оплачена.

Направляем вам данные для оплаты с вашей стороны. Пожалуйста, произведите оплату в удобное для вас время.

Оплата гос. пошлины {amount}$

Вместо номера телефона вводите yulia87andreeva@gmail.com

Бизнес название Andreev life LLC
После оплаты пришлите скрин

Обязательно регулярно проверяйте ваш электронный адрес, так как Board может направить дополнительные запросы или уточнения. В случае получения каких-либо писем, пожалуйста, сразу отправляйте их нам в чат, чтобы мы могли оперативно отреагировать и сопровождать ваш процесс.
""",

    "NY": """
Добрый день! 
Ваша заявка на получение лицензии в штате Нью-Йорк заполнена. Для её подачи необходимо оплатить государственную пошлину в размере $40.

Вы можете произвести оплату самостоятельно, либо, при вашем согласии, прислать нам данные банковской карты - мы сразу оплатим пошлину и незамедлительно удалим платёжную информацию из чата.

Инструкция по оплате заявки
1. Перейдите на сайт по ссылке: https://www.businessexpress.ny.gov/.
2. Введите свои данные для входа: логин и пароль.
3. После входа в систему вы увидите серое окно с вашей заявкой (application).
4. Нажмите кнопку “Resume”.
5. Откроется страница “Application Summary”.
6. Пролистайте страницу в самый низ и нажмите “Next”.
7. На следующей странице снова пролистайте вниз и нажмите “Proceed to Payment”.
8. Произведите оплату заявки.

После того как вы произведёте оплату, заявка считается полностью заполненной и поданной.
Ожидаемый срок рассмотрения — от 2 до 4 рабочих дней.

Обратите внимание: в процессе рассмотрения борд может направить дополнительные запросы или вопросы. Если вы получите такие письма, сразу перешлите их нам, чтобы мы могли оперативно отреагировать.

После одобрения электронная лицензия будет направлена на e-mail, который вы указывали в анкете.
Также в течение 7–14 дней после одобрения печатная лицензия поступит вам по почте.

Пожалуйста, обязательно регулярно проверяйте e-mail (включая папки Spam и Promotions).
Как только вы получите электронную лицензию, сразу сообщите нам.

Также после получения бумажной лицензии по почте обязательно напишите нам, чтобы мы убедились, что всё прошло корректно.
"""
}

ACCOUNT_CHECK = """
Доброе утро!

Подскажите, пожалуйста, есть ли у вас аккаунт на сайте:
https://www.ny.gov/services/licenses ?

Обычно на этом сайте оформляют водительское удостоверение (driver license), поэтому, возможно, у вас уже есть доступ.

Если у вас есть данные для входа — пожалуйста, пришлите их в чат.

Если аккаунта нет, мы создадим его для вас. На вашу почту придёт ссылка, по которой вам нужно будет:
— ответить на 3 секретных вопроса
— сохранить ответы на них
— придумать пароль

После этого, пожалуйста, пришлите нам пароль в чат.
"""

LICENSE_APPROVED = {
    "CA": """
Здравствуйте! Отличные новости — ваша лицензия трансферного штата одобрена! 🎉

Следующим этапом мы переводим её в Калифорнию. Подача заявки на перевод и рассмотрение занимает от 1 месяца. Для завершения процесса необходимо внести вторую часть оплаты.
Ваш текущий остаток составляет {amount}$. Подскажите, у вас сохранились данные для оплаты или продублировать?

Если возникнут вопросы — мы всегда на связи!
""",

    "FL": """
Здравствуйте! Отличные новости — ваша лицензия трансферного штата одобрена! 🎉

Следующим этапом мы переводим её в штат Флорида. Подача заявки на перевод и рассмотрение занимает от 1 месяца. Для завершения процесса необходимо внести вторую часть оплаты.
Ваш текущий остаток составляет {amount}$. Подскажите, у вас сохранились данные для оплаты или продублировать?

Если возникнут вопросы — мы всегда на связи!
"""
}

BORD_CREATED = """
Здравствуйте!
Для вас был создан аккаунт в системе борда, и на ваш email отправлен временный пароль.
Пожалуйста, как только получите письмо — пришлите временный пароль в этот чат.

Спасибо!
"""

APPLICATION_COMPLETED = {
    "CA": """
Здравствуйте!

Мы заполнили вашу заявку. Для её подачи необходимо оплатить государственную пошлину в размере ${amount}. На оплату у вас есть 24 часа, после этого заявка станет неактивной.

Для оплаты пошлины, пожалуйста, выполните следующие шаги:

1️⃣ Перейдите на сайт:
https://www.breeze.ca.gov/datamart/loginCADCA.do

2️⃣ Введите данные для входа:
Login: {login}
Password: {password}

3️⃣ После входа, в правой колонке выберите пункт “Make a Payment”

4️⃣ Выберите способ оплаты Visa / Card → нажмите Next

5️⃣ Введите данные вашей банковской карты и подтвердите оплату

⏰ Обратите внимание: оплату необходимо выполнить в течение 24 часов с момента подачи заявки, чтобы она не была аннулирована.

После оплаты, пожалуйста, пришлите подтверждение (скриншот или сообщение об успешной оплате).

Спасибо!
""",

    "FL": """
Здравствуйте!

Мы заполнили вашу заявку. Для её подачи необходимо оплатить государственную пошлину в размере ${amount}. На оплату у вас есть 4 часа, после этого заявка станет неактивной.

Сайт: https://www.myfloridalicense.com/datamart/loginFLDBPR.do

Логин: {login}
Пароль: {password}

1️⃣ Перейдите по ссылке и войдите в свой аккаунт
2️⃣ В левом углу вы увидите перечень функций — выберите раздел “Make an Online Payment”
3️⃣ Перейдите в этот раздел и выберите способ оплаты Credit Card
4️⃣ Нажмите Next, затем еще раз Next
5️⃣ Введите данные вашей банковской карты
6️⃣ Снова нажмите Next и завершите оплату

⚠️ Важное напоминание: на оплату заявки у вас есть только 4 часа. После истечения этого времени заявка становится неактивной, поэтому, пожалуйста, произведите оплату сразу после входа в аккаунт.
"""
}

BORD_MESSAGE = """
После оплаты вы получите письмо от Борда с просьбой запросить подтверждение вашей лицензии в штате, где она была выдана. Пожалуйста, не переживайте - такой запрос является стандартной процедурой. Мы отправили его в тот же день, когда подавали вашу заявку. Поэтому подобное сообщение можно получить, и это абсолютно в пределах нормы.

Мы держим процесс под контролем и будем информировать вас о каждом следующем шаге.
"""

EMAIL_CHECK = """
Пожалуйста, регулярно проверяйте ваш email, так как туда могут приходить письма от борда. Если вы получите какие-либо сообщения, пожалуйста, сразу отправляйте их в этот чат, чтобы мы могли своевременно отреагировать.
"""

CONGRATULATIONS = {
    "CA": """
Добрый день!

Отличные новости — ваша лицензия одобрена! 🎉
Мы готовы передать ваши данные в PSI-центр для получения лицензии.

📍 Выдача лицензии по адресу:

• Телефон: +1 (916) 476-5926
• Официальный сайт: psiexams.com
🕒 График работы центра: актуальное расписание можно посмотреть в Google Maps

При посещении PSI-центра возьмите с собой удостоверение личности (ID) и номер вашего файла #{fileNumber}. На месте вас сфотографируют и выдадут лицензию.

Ниже указаны данные для входа в ваш личный кабинет на сайте Breeze California:

🔐 Логин: {login}
🔐 Пароль: {password}

🔗 Сайт: https://www.breeze.ca.gov/datamart/loginCADCA.do

Если у вас возникнут вопросы по дальнейшим шагам — пожалуйста, обращайтесь, с радостью помогу.

Поздравляем вас с успешным результатом! 🎉

""",

    "FL": """
Здравствуйте! 🌸

Поздравляем! Ваша лицензия во Флориде успешно одобрена ✅

Обратите внимание:
📩 Лицензия приходит на ваш e-mail от Department of Business and Professional Regulation (DBPR).
Флорида не высылает бумажные версии, поэтому вам нужно распечатать лицензию самостоятельно и сохранить копию для себя.

Если хотите войти в личный кабинет для проверки или обновления данных, используйте сайт:
🔗 https://www2.myfloridalicense.com/cosmetology/
Логин: {login}
Пароль: {password}

Если у вас возникнут дополнительные вопросы, вы можете напрямую связаться с Юлией Андреевой по телефону:
📞 +1 (279) 230-2804

По всем вопросам — пишите или звоните, будем рады помочь!
"""
}

REVIEW = """
Здравствуйте! 👋
Мы очень рады, что смогли помочь вам в получении лицензии! 🎉

Если у вас будет минутка, пожалуйста, оставьте отзыв о нашей работе. Нам будет особенно приятно, если вы сможете сделать фотографию своей лицензии или сфотографироваться с ней — это помогает другим клиентам увидеть реальный результат.

✅ Все ваши персональные данные (номер лицензии, адрес и др.) будут обязательно закрыты и останутся конфиденциальными.

Спасибо большое за ваше доверие и время!
Мы очень ценим каждого клиента ❤️
https://www.instagram.com/andreeva__iuliia?igsh=NTc4MTIwNjQ2YQ==

Работа по вашему запросу успешно завершена ✅

Пожалуйста, сохраните ваши данные для входа на сайт.
Также, если у вас возникнут дополнительные вопросы, вы можете напрямую связаться с Юлией Андреевой по телефону: +1 279 230 2804

❗️Обратите внимание: данный рабочий чат будет удалён.
"""

ADDITIONAL_MESSAGES = {
    "LICENSE_EG": """
License

Please carefully fill out the form below. Make sure all information is provided exactly as it appears in your official documents. This will help us avoid errors and delays in processing your license.

1) Your First and Last Name in English – enter exactly as in your passport or driver’s license (without abbreviations, extra symbols, or errors)

2) Your state

3) Full Name in Russian (patronymic is required)

4) Full Name in Ukrainian (if applicable)

5) Have you changed your last name and when?

6) Your date of birth format M/D/Y

7) SSN number (required for the license)

8) Your phone number

9) Your email (preferably google.com, icloud.com, yahoo.com)

10) Your username with @ in Telegram

11) Your home address (house number/street/apartment/city/county/state/zip code)
Example: 1234 Main St, Apt 5B, Los Angeles, CA 90012

12) Name of your primary care physician

13) Clinic address

14) City and country of residence before moving to the USA

15) What type of license do you want to obtain? (If you are not sure which type suits you, skip this question.)

• Cosmetologist — includes hair services, skincare, and nail services (manicure/pedicure)
• Esthetician — skincare only (face and body), no hair services and no nail services
• Manicurist / Nail Technician — nail services (manicure and pedicure)

16) What services do you want to provide to determine the type of license (list all services!)

17) Provide details of two people who can confirm your work experience:

First and Last Name
Salon name (where you worked/rented a place)
Salon address

18) Since what month and year have you been in the USA
""",

    "READY_FOR_PAYMENT": """
Добрый день! Подскажите, пожалуйста, когда вы будете готовы внести оплату, чтобы продолжить процесс?
""",

    "THANKS_FOR_INFORMATION": """
Благодарим вас за предоставленную информацию. Мы приступаем к подготовке документов. Пожалуйста, оставайтесь на связи на случай, если у нас возникнут вопросы.
""",

    "SUCCESSEFULLY_RECIEVE": """
Добрый день!
Хочу убедиться, что вы успешно получили лицензию и всё прошло благополучно.
Если возникли сложности или потребуется помощь — пожалуйста, дайте знать.
"""
}
